{
    "architectures": [
        "LlamaForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 8192,
    "initializer_range": 0.02,
    "intermediate_size": 22016,
    "max_position_embeddings": 16384,
    "model_type": "llama",
    "num_attention_heads": 64,
    "num_hidden_layers": 48,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.32.0",
    "use_cache": false,
    "vocab_size": 32016,
    "auto_map": {
        "AutoConfig": "configuration_llama.LlamaConfig",
        "AutoModel": "modeling_llama.LlamaModel",
        "AutoModelForCausalLM": "modeling_llama.LlamaForCausalLM",
        "AutoModelForSequenceClassification": "modeling_llama.LlamaForSequenceClassification"
    },
    "rope_theta": 1000000,
    "quantization_config": {
        "bits": 4,
        "group_size": 32,
        "damp_percent": 0.1,
        "desc_act": true,
        "sym": true,
        "true_sequential": true,
        "model_name_or_path": null,
        "model_file_base_name": "model",
        "quant_method": "gptq"
    },
    "pad_token_id": 0
}
